[
  {"id": 1, "use": true, "param": "iterations", "type": "int", "default_value": 125, "name": "Кол-во итераций", "info": "По умолчанию Cat Boost строит 125 деревьев. Количество итераций может быть уменьшено для ускорения обучения.\n\nКогда количество итераций уменьшается, скорость обучения необходимо увеличить. По умолчанию значение скорости обучения определяется автоматически в зависимости от количества итераций и входного набора данных. Изменение количества итераций на меньшее значение является хорошей отправной точкой для оптимизации.", "diap": [50, 1000]},
  {"id": 2, "use": true, "param": "learning_rate", "type": "float", "default_value": 0.055, "name": "Скорость обучения", "info": "Скорость обучения по умолчанию близка к оптимальной, но ее можно настроить для получения наилучшего качества. Смотрите на значения оценочных показателей на каждой итерации, чтобы настроить скорость обучения.:\n\nУменьшите скорость обучения, если наблюдается переобучение.\nУвеличьте скорость обучения, если нет переобучения и ошибка в наборе оценочных данных все еще уменьшается на последней итерации.", "diap": [0.01, 0.1]},
  {"id": 3, "use": true, "param": "depth", "type": "int", "default_value": 7, "name": "Глубина дерева", "info": "В большинстве случаев оптимальная глубина составляет от 4 до 10. Рекомендуется использовать значения в диапазоне от 6 до 10.", "diap": [2, 12]},
  {"id": 4, "use": true, "param": "l2_leaf_reg", "type": "float", "default_value": 5.5, "name": "L2 регуляризация", "info": "Попробуйте разные значения для регуляризатора, чтобы найти наилучший возможный.\n\nКоэффициент на сроке регуляризации L2 функции затрат.\n\nДопускается любое положительное значение.", "diap": [1, 10]},
  {"id": 5, "use": true, "param": "is_permutate", "type": "bool", "default_value": false, "name": "Считать значимость факторов", "info": "Следует ли высчитывать значимость факторов, учтите что время их выполнения много больше обучения модели и предпочтительно использовать это уже на обученных моделях для улучшения результатов", "diap": null}
]